### Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "austinjones/taps"

brew "arduino-cli"
brew "llvm"
brew "python"
brew "rustup-init"
cask "julia"

#### TUI
brew "neovim", args: ["HEAD"]  # nvim 0.5
brew "austinjones/taps/tab"    # tab-rs term-multiplexer
brew "zsh-syntax-highlighting"
cask "alacritty"

#### utils
brew "ripgrep"
brew "tokei"

#### Writing
brew "pandoc"
brew "texlab"        # TeX language server
brew "zola"          # SSG
cask "mactex-no-gui"

#### GUI & Other Casks
cask "android-file-transfer"
cask "android-platform-tools"
cask "discord"
cask "firefox"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-ibm-plex"
cask "font-juliamono"
cask "google-backup-and-sync"
#cask "ghdl"
#cask "gtkwave"
cask "iina"          # media player
cask "itsycal"       # menu bar calendar. Y-M-d EEEEE HH:mm
cask "protonvpn"
cask "qbittorrent"
cask "rectangle"     # window manager
cask "spotify"
cask "supercollider"
cask "zotero"
