tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "deno"
brew "node@20" # Active LTS until 2024-10-22
brew "pnpm"
brew "janet"
brew "juliaup"
# brew "llvm"
# brew "python"
brew "rustup-init"
brew "stylua"

brew "fish"
brew "jq"
brew "neovim"
brew "pandoc"
brew "ripgrep"
brew "tokei"
brew "typst"
brew "zola"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "firefox"
cask "font-ibm-plex"
cask "font-juliamono"
cask "iina"           # media player
cask "itsycal"        # menu bar calendar. Y-MM-dd EEEEE HH:mm
cask "musescore"
cask "netnewswire"    # RSS reader
cask "rectangle"      # window manager
cask "sioyek"         # PDF reader
cask "the-unarchiver"
cask "transmission"   # BT client
cask "wezterm"
cask "zotero"

cask "discord"
cask "protonvpn"
cask "slack"
cask "spotify"

# vim:filetype=ruby
