tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "austinjones/taps"

brew "arduino-cli"
brew "gforth"
brew "julia"
brew "llvm"
brew "python"
brew "rust-analyzer"
brew "rustup-init"

brew "neovim", args: ["HEAD"]
brew "zsh-syntax-highlighting"
brew "austinjones/taps/tab"

brew "ripgrep"
brew "tokei"

brew "tectonic"
brew "zola"

cask "alacritty"
cask "android-file-transfer"
# cask "android-platform-tools"
cask "discord"
cask "firefox"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-ibm-plex"
cask "font-juliamono"
cask "google-backup-and-sync"
# cask "ghdl"
# cask "gtkwave"
cask "iina"          # media player
cask "itsycal"       # menu bar calendar. Y-M-d EEEEE HH:mm
cask "protonvpn"
cask "qbittorrent"
cask "rectangle"     # window manager
cask "spotify"
cask "zotero"
